---
title: نسخه ۲۴ LineageOS منتشر شد!
date: 2026-10-11
author: امیرعلی اکبری
excerpt: خلاصه‌ای از تغییرات جدیدترین نسخه سیستم‌عامل لینیج
lang: fa
section: blog
---

نسخه ۲۴ سیستم عامل LineageOS در ۱۹ مهر ۱۴۰۵ منتشر شد. این نسخه مبتنی بر اندروید ۱۷ است که تیر ماه امسال منتشر شده است. این نسخه از لینیج در آستانه دهمین سال فعالیت این پروژه عرضه شده است.

لینیج ۲۴ علاوه بر اعمال وصله‌های امنیتی اندروید، نسخه‌های جدیدتر از برنامه‌های کاربردی را به همراه دارد. برنامه‌های Catapult (لانچر برای تلویزیون‌های هوشمند)، Etar (تقویم)، Twelve (پخش کننده موسیقی)، Seedvault (ابزار سیستم‌عاملی پشتیبان‌گیری از گوشی)، و وب ویوی سیستم به آخرین نسخه خود به‌روزرسانی شده‌اند. به ویژه بسیاری از برنامک‌های لینیج بر اساس متریال ۳ طراحی ‌شده‌اند.

همچنین در این نسخه، از Canvas به عنوان ابزار جدید ویرایش عکس‌ها استفاده شده است. برنامک مرورگر Jelly از ایجاد میانبرها برای سایت‌ها با رفتاری شبیه برنامک‌های PWA پشتیبانی می‌کند. برنامک SetupWizard هم علاوه بر طراحی مدرن‌تر، معماری جدیدی برای فرآیند آغاز به کار کاربر دارد، و امکان ایجاد صفحات مختص به دستگاه را نیز فراهم می‌کند.

برنامک به‌روزرسان سیستم، نسخه‌ها را دیگر به صورت جریانی دریافت می‌کند که باعث کاهش زمان نصب نسخه‌های جدید سیستم عامل می‌شود. رابط کاربری آن نیز بهبود یافته و امکان نمایش توضیحات به کاربر هم فراهم شده است. در دستگاه‌های بدون پشتیبانی از روش به‌روزرسانی A/B، پارتیشن ریکاوری بعد از اولین راه‌اندازی پس از به‌روزرسانی موفق به طور خودکار به‌روزرسانی می‌شود. سایر تغییرات مانند استفاده از طراحی متریال ۳ و بهبود ظاهر در تبلت‌ها و تلویزیون‌ها نیز در نسخه جدید به‌روزرسان وجود دارد.

از این نسخه می‌توان از ابزار فلش آنلاین لینیج برای نصب هر چه ساده‌تر نسخه‌ها روی گوشی با پروتکل WebUSB استفاده کرد.

یک فرآیند تست دسترسی‌پذیری نیز روی روند راه‌اندازی و برنامک‌های لینیج توسط پروژه a11y انجام شده که امکان استفاده از لینیج را برای قشر گسترده‌تری از کاربران با شرایط خاص فراهم می‌کند.

از نسخه ۲۴ توصیه جدی لینیج به عدم استفاده از نسخه‌های قدیمی کرنل از جمله ۴.۴ و ۴.۹ برای دستگاه‌ها است.

امکان به‌روزرسانی تعداد قابل توجهی از گوشی‌ها به نسخه لینیج ۲۴ از هم‌اکنون وجود دارد. برای اطلاعات بیشتر، [شرح تغییرات این نسخه](https://lineageos.org/Changelog-32/) را مشاهده کنید.
